KanatERPSukhova.КанатАдаптация/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="951a5403-e1a4-4484-8fda-c18df8f291d3">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e654eb8f-cadf-4ea9-b106-6855158dcb94">
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Catalogs/РесурсныеСпецификации/РесурсныеСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ee5a63d2-90be-4f36-8a88-5415230abebc">
  <name>РесурсныеСпецификации</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="436cac62-4694-43a2-8d22-669228b1baf1">
    <name>ОсновноеИзделиеКоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc79d025-e4b3-4adf-ad53-eda1f76f3bfa">
    <name>ОсновноеИзделиеНоменклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50617dd7-6ff4-4dc2-a0d1-1996bd1af55b">
    <name>ОсновноеИзделиеХарактеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ТехнологическаяСпецификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ДокладнаяЗаписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Основание</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="dea18009-f98d-468a-859b-cf3cce9196a0">
    <name>СпособРаспределенияЗатратНаВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f541bc89-351d-4def-99c7-bc02b9497244">
    <name>ВариантНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ef8d7a41-0646-43ad-88f6-4a05fdfd4001">
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7c508eb-b4e9-4a54-9256-56fe64f44bf1">
    <name>НачалоДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c0db759b-cb86-470f-ac1a-4622007748c9">
    <name>КонецДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fccdf260-9852-4290-a022-4a8aa7f7f0f4">
    <name>ВыпускПроизвольнымиПорциями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="052b8eae-f60e-4c3c-abd6-a4695a5e825e">
    <name>МинимальнаяПартияВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b7f922c-a145-4699-8371-53c4af687ca8">
    <name>МногоэтапныйПроизводственныйПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e3abe02c-7357-44f4-8c29-1103001fc9a0">
    <name>ЕстьНекратныеНормативыВРЦ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="274549a5-518a-4913-a049-05b30732d5ba">
    <name>ТипПроизводственногоПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5bbc3dbe-eeea-4b75-9545-caf94f8f036f">
    <name>РазрешитьВыборДляИзделийПобочногоВыхода</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1c367fe-c52b-4c0f-a74f-6845403cc761">
    <name>ОптимальнаяПартияВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="add9bf8f-b6e4-499c-97f2-421c3d17eb91">
    <name>ОграниченСрокПролеживанияВыходныхИзделий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="406ad767-ca83-4ad0-b1f8-9ac8daee6f79">
    <name>МаксимальныйСрокПролеживанияВыходныхИзделий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="606417f4-2092-4500-a40a-6e49ae00544d">
    <name>ОптимальноеКоличествоПередачиМеждуЭтапами</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f7f6ae2-e8b9-4fce-8fa3-629ee39f2ca5">
    <name>ПечатьМаршрутнойКарты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f664e98-6ce5-44b6-b35a-8e83c01a9b69">
    <name>ОсновноеИзделиеВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c90f934b-9c20-478f-85ee-7274cd9979b8">
    <name>ОписаниеУточненияПрименения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fc2e8a86-949a-4e4f-812b-94f43e3fd12e">
    <name>ОсновноеИзделиеУпаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f3124293-0b8d-4882-b23c-439b2566fc63">
    <name>ОсновноеИзделиеЭтап</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8cfece92-bb5d-4623-871a-42563d78d9c0">
    <name>ЕстьВложенныеСпецификации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5c232012-137e-4fe3-a365-c69eecfc553a">
    <name>ДопустимоеПревышениеОптимальнойПартииВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d9e9276-13e9-4b17-a242-69b99618df3c">
    <name>ВариантПодбораВДокументы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0634919c-9496-4ed5-8d44-222275fdf51d">
    <name>ЕстьУточняемоеОсновноеИзделие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="71f3c8a4-5f20-400f-aef5-acbf7a734855">
    <name>ЕстьПараметризацияРесурсов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="02138102-fb2c-4d61-a0ee-ad75034be9fa">
    <name>ЕстьРасчетВероятности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c225c8c7-cc0e-4917-91b9-de521887536d">
    <name>ОтветственноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f0ad745f-112b-4b3c-8d90-d1200757685d">
    <name>ИдентификаторВерсииДанных</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f3f60468-b96f-4528-8adc-5b0b567a3e3d">
    <name>МатериалыИУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e3112143-6304-49ed-abcf-b14fe2425c34">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d938bbe4-fc79-49eb-ba11-f6f1d62d7ab4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c760a5ad-a536-49ec-816d-fad0d87140f3">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2a6c2c71-230f-425a-a0e6-d556c2f47f3a">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dee0ba41-dd89-4212-ace9-8a7a209bce5b">
      <name>АлгоритмАвтовыбораХарактеристики</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b1e20410-a0e0-4aba-8122-7aef753d2cd5">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="71a20cef-31cc-4da2-82e6-195ae04b99d6">
      <name>ТребуетсяУказыватьСерии</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a9766914-b51b-49c3-854b-6185efea75fc">
      <name>ОписаниеИзделия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e00a89f7-24ad-4d28-8e86-331ef04bb0d7">
    <name>ВозвратныеОтходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="76aa45fe-dde7-48b0-940f-7eaf21bba0cc">
    <name>Трудозатраты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/CommonModules/РазузлованиеИзделий/Module.bsl
//&Вместо("РазделитьПотребностиНаПартии")
//Функция КАНАТ_РазделитьПотребностиНаПартии(Потребности, ПараметрыРазузлования)
//	
//	Результат = Новый Массив;
//	
//	Входы = Новый ТаблицаЗначений;
//	Входы.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла));
//	Входы.Колонки.Добавить("Этап", Новый ОписаниеТипов("СправочникСсылка.ЭтапыПроизводства"));
//	Входы.Колонки.Добавить("СтрокаРС", Новый ОписаниеТипов("СтрокаТаблицыЗначений"));
//	Входы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//	Входы.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
//	Входы.Колонки.Добавить("КодЭтапа", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла));
//	Входы.Колонки.Добавить("ДанныеСпецификации", Новый ОписаниеТипов("Структура"));
//	
//	Выходы = Новый ТаблицаЗначений;
//	Выходы.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла));
//	Выходы.Колонки.Добавить("Этап", Новый ОписаниеТипов("СправочникСсылка.ЭтапыПроизводства"));
//	Выходы.Колонки.Добавить("СтрокаРС", Новый ОписаниеТипов("СтрокаТаблицыЗначений"));
//	Выходы.Колонки.Добавить("СтрокаРСИмяВладельца", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки));
//	Выходы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//	Выходы.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
//	Выходы.Колонки.Добавить("ДанныеСпецификации", Новый ОписаниеТипов("Структура"));
//	Выходы.Колонки.Добавить("Потребность", Новый ОписаниеТипов("СтрокаТаблицыЗначений"));
//	
//	СтПоискаПФНаЭтапе = Новый Структура("СпособПолученияМатериала, СпецификацияРемонта",
//		Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе,
//		Справочники.РесурсныеСпецификации.ПустаяСсылка());
//	СтПоискаНХЭтап = Новый Структура("Номенклатура, Характеристика, Этап");
//	//++ НЕ УТКА
//	СтПоискаАналоги = Новый Структура("СтрокаИндекс, Разрешение");
//	//-- НЕ УТКА
//	
//	Потребности.Сортировать("Порядок, Начало, Окончание, Уровень, Номенклатура, Характеристика, Спецификация, Назначение, Получатель, Отправитель");
//	
//	КодЭтапа = 10000000;
//	Для ИндексПотребность = 0 По Потребности.Количество()-1 Цикл
//		
//		Потребность = Потребности[ИндексПотребность];
//		Если Потребность.Свернута Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		ВсегоПартий = 1;
//		Если ПараметрыРазузлования.РазделятьНаОптимальныеПартии
//				И Потребность.ПартияВыпуска.Расшифровка <> Неопределено Тогда
//			ВсегоПартий = Потребность.ПартияВыпуска.Расшифровка.Количество();
//		КонецЕсли;
//		
//		Для СчПартий = 1 По ВсегоПартий Цикл
//			
//			// Заполнение партии
//			Если ВсегоПартий = 1 Тогда
//				ДанныеСпецификации = Потребность.ДанныеСпецификации;
//				ПартияВыпуска = Потребность.ПартияВыпуска;
//			Иначе
//				ДанныеСпецификации = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Потребность.ДанныеСпецификации);
//				
//				ПартияВыпуска = Потребность.ПартияВыпуска.Расшифровка[СчПартий-1];
//				ДанныеПоНоменклатуре = Справочники.РесурсныеСпецификации.ДанныеПоНоменклатуреРасширенный();
//				ЗаполнитьЗначенияСвойств(ДанныеПоНоменклатуре, Потребность);
//				Справочники.РесурсныеСпецификации.РассчитатьКоличествоНаПартиюВыпуска(ПартияВыпуска, ДанныеСпецификации, ДанныеПоНоменклатуре);
//				
//				Для каждого Этап Из ДанныеСпецификации.Этапы Цикл
//					Этап.КодЭтапа = КодЭтапа;
//					КодЭтапа = КодЭтапа + 1;
//				КонецЦикла;
//			КонецЕсли;
//			
//			ДобавитьПоляВДанныеСпецификации(ДанныеСпецификации, ПараметрыРазузлования);
//			
//			ЗаполнитьЗначенияСвойств(
//				ДанныеСпецификации,
//				Потребность,
//				"ДатаЗапуска, ДатаВыпуска, Начало, Окончание, РазмещениеВыпуска"
//				+ ?(ПустаяСтрока(ПараметрыРазузлования.ПоляГруппировки), "", "," + ПараметрыРазузлования.ПоляГруппировки)
//				+ ?(ПустаяСтрока(ПараметрыРазузлования.ДополнительнаяИнформация), "", "," + ПараметрыРазузлования.ДополнительнаяИнформация));
//			
//			ДанныеСпецификации.ПартияВыпуска = ПартияВыпуска;
//			
//			Если ДанныеСпецификации.ВыходныеИзделия.Количество() <> 0 Тогда
//				ДанныеСпецификации.ВыходныеИзделия.ЗагрузитьКолонку(
//					ДанныеСпецификации.ВыходныеИзделия.ВыгрузитьКолонку("Склад"), "Получатель");
//			КонецЕсли;
//			Если ДанныеСпецификации.ВозвратныеОтходы.Количество() <> 0 Тогда
//				ДанныеСпецификации.ВозвратныеОтходы.ЗагрузитьКолонку(
//					ДанныеСпецификации.ВозвратныеОтходы.ВыгрузитьКолонку("Склад"), "Получатель");
//			КонецЕсли;
//			
//			// Заполнение реквизитов по входящим данным
//			Для Индекс = 0 По Потребность.СвернутыеВходящиеПотребности.Количество() Цикл
//				ВхПотребность = ?(Индекс = 0,
//					?(Потребность.ЭтоВходящаяПотребность, Потребность, Неопределено),
//					Потребность.СвернутыеВходящиеПотребности[Индекс - 1]);
//				Если ВхПотребность = Неопределено ИЛИ ВхПотребность.Количество = 0 Тогда
//					Продолжить;
//				КонецЕсли;
//				
//				//++ НЕ УТКА
//				Если ВхПотребность.ЭтоРазборка Тогда
//					
//					Для каждого Строка Из ДанныеСпецификации.ВходящиеИзделия Цикл
//						
//						Если Строка.Распределено = Строка.Количество
//							ИЛИ Строка.Номенклатура <> ВхПотребность.Номенклатура
//							ИЛИ Строка.Характеристика <> ВхПотребность.Характеристика
//								И ЗначениеЗаполнено(Строка.Характеристика)
//								И НЕ Строка.ЛюбаяХарактеристика Тогда
//							Продолжить;
//						КонецЕсли;
//						
//						Если ВхПотребность.Количество >= Строка.Количество Тогда
//							СтрокаЗаполнить = Строка;
//						Иначе
//							НоваяСтрока = ДанныеСпецификации.ВходящиеИзделия.Добавить();
//							ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
//							НоваяСтрока.Количество = ВхПотребность.Количество;
//							НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
//								* НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
//							СтрокаЗаполнить = НоваяСтрока;
//								
//							Строка.Количество = Строка.Количество - ВхПотребность.Количество;
//							Строка.КоличествоУпаковок = Строка.Количество
//								* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
//						КонецЕсли;
//						
//						Если ЗначениеЗаполнено(ВхПотребность.Отправитель) Тогда
//							СтрокаЗаполнить.Склад = ВхПотребность.Отправитель;
//						КонецЕсли;
//						СтрокаЗаполнить.Характеристика = ВхПотребность.Характеристика;
//						Если ЗначениеЗаполнено(ВхПотребность.ЭтапИсточник) Тогда
//							СтрокаЗаполнить.ЭтапОтправитель = ВхПотребность.ЭтапИсточник;
//							СтрокаЗаполнить.Обособленно = Истина;
//							СтрокаЗаполнить.Производится = Истина;
//						КонецЕсли;
//						СтрокаЗаполнить.Распределено = СтрокаЗаполнить.Количество;
//						
//						ВхПотребность.Количество = ВхПотребность.Количество - СтрокаЗаполнить.Количество;
//						Если ВхПотребность.Количество = 0 Тогда
//							Прервать;
//						КонецЕсли;
//					КонецЦикла;
//					
//				Иначе // Сборка и ремонт

//				//-- НЕ УТКА
//					
//					Для Сч = 1 По 2 Цикл
//						Для каждого Строка Из ДанныеСпецификации[?(Сч = 1, "ВыходныеИзделия", "ВозвратныеОтходы")] Цикл
//							Если Строка.Распределено = Строка.Количество
//								ИЛИ Строка.Номенклатура <> ВхПотребность.Номенклатура
//								ИЛИ Строка.Характеристика <> ВхПотребность.Характеристика
//									И ЗначениеЗаполнено(Строка.Характеристика)
//									И НЕ Строка.ЛюбаяХарактеристика Тогда
//								Продолжить;
//							КонецЕсли;
//							
//							Распределено = Мин(Строка.Количество-Строка.Распределено, ВхПотребность.Количество);
//							
//							Если (Строка.Распределено = 0
//									И ВхПотребность.Количество >= Строка.Количество)
//								ИЛИ (СтрокиИдентичны(Строка, ВхПотребность,
//										"Характеристика,Получатель,Назначение,СписатьНаРасходы,СтатьяРасходов,АналитикаРасходов,АналитикаАктивовПассивов")
//									И Строка.ЭтапПотребитель = ВхПотребность.ЭтапИсточник) Тогда
//								
//								// Разделять строку не нужно
//								СтрокаЗаполнить = Строка;
//								
//							ИначеЕсли Строка.Округлить
//								И НЕ Строка.ЭтоЦеховаяКладовая
//								И Окр(Строка.Количество - Распределено) <> (Строка.Количество - Распределено) Тогда
//								
//								// При разделении строки будут нарушены правила округления
//								Если Строка.Распределено = 0 Тогда
//									Строка.Округлить = Ложь;
//									СтрокаЗаполнить = Строка;
//								Иначе
//									ВладелецСтроки = Строка.Владелец(); // ТаблицаЗначений
//									НоваяСтрока = ВладелецСтроки.Добавить();
//									ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
//									НоваяСтрока.Количество = Строка.Количество - Строка.Распределено;
//									НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
//										* НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
//									НоваяСтрока.Распределено = 0;
//									НоваяСтрока.Округлить = Ложь;
//									СтрокаЗаполнить = НоваяСтрока;
//									
//									Строка.Количество = Строка.Распределено;
//									Строка.КоличествоУпаковок = Строка.Количество
//										* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
//									Если Сч = 1 Тогда
//										ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
//											НоваяСтрока, Строка, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
//									КонецЕсли;
//								КонецЕсли;
//								
//							Иначе
//								
//								// Разделение строки
//								ВладелецСтроки = Строка.Владелец(); // ТаблицаЗначений
//								НоваяСтрока = ВладелецСтроки.Добавить();
//								ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
//								НоваяСтрока.Количество = Распределено;
//								НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
//									* НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
//								НоваяСтрока.Распределено = 0;
//								СтрокаЗаполнить = НоваяСтрока;
//								
//								Строка.Количество = Строка.Количество - Распределено;
//								Строка.КоличествоУпаковок = Строка.Количество
//									* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
//								Если Сч = 1 Тогда
//									ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
//										НоваяСтрока, Строка, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
//								КонецЕсли;
//								
//							КонецЕсли;
//							
//							ЗаполнитьЗначенияСвойств(СтрокаЗаполнить, ВхПотребность,
//								"Характеристика,Получатель,Назначение,СписатьНаРасходы,СтатьяРасходов,АналитикаРасходов,АналитикаАктивовПассивов");
//							СтрокаЗаполнить.ЭтапПотребитель = ВхПотребность.ЭтапИсточник;
//							СтрокаЗаполнить.Распределено = СтрокаЗаполнить.Распределено + Распределено;
//							
//							ВхПотребность.Количество = ВхПотребность.Количество - Распределено;
//							Если ВхПотребность.Количество = 0 Тогда
//								Прервать;
//							КонецЕсли;
//							
//						КонецЦикла;
//						Если ВхПотребность.Количество = 0 Тогда
//							Прервать;
//						КонецЕсли;
//					КонецЦикла;
//				
//				//++ НЕ УТКА	
//				КонецЕсли;
//				//-- НЕ УТКА
//				
//			КонецЦикла;
//			
//			// Зачет данных обеспечения
//			Свертка = Новый Соответствие;
//			МатериалыУдалить = Новый Массив;
//			Для каждого Обеспечение Из Потребность.Обеспечение Цикл
//				Строка = ДанныеСпецификации.МатериалыИУслуги[Обеспечение.СтрокаИндекс];
//				Если Обеспечение.Количество = 0 ИЛИ Строка.Количество = 0 ИЛИ НЕ Строка.Производится Тогда
//					Продолжить;
//				КонецЕсли;
//				
//				КоличествоЗачет = Мин(Строка.Количество, Обеспечение.Количество);
//				
//			//++ НЕ УТКА
//				Если Обеспечение.ЗаменаНаАналог Тогда
//					
//					// Обеспечение через замену на аналоги
//					ЗаполнитьЗначенияСвойств(СтПоискаАналоги, Обеспечение);
//					Для каждого Аналог Из Потребность.Аналоги.НайтиСтроки(СтПоискаАналоги) Цикл
//						НоваяСтрока = ДанныеСпецификации.МатериалыИУслуги.Добавить();
//						ЗаполнитьЗначенияСвойств(НоваяСтрока, Аналог, "Номенклатура,Характеристика,Склад");
//						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Этап,ПодразделениеЭтапа");
//						Если Обеспечение.Количество = КоличествоЗачет Тогда
//							НоваяСтрока.Количество = Аналог.Количество;
//						Иначе
//							НоваяСтрока.Количество = ОКР(Аналог.Количество * КоличествоЗачет / Обеспечение.Количество, 3);
//							Аналог.Количество = Аналог.Количество - НоваяСтрока.Количество;
//						КонецЕсли;
//						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
//						НоваяСтрока.Обособленно = Обеспечение.Обособленно;
//						НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
//						НоваяСтрока.Производится = Ложь;
//					КонецЦикла;
//					
//					Строка.Количество = Строка.Количество - КоличествоЗачет;
//					Если Строка.Количество = 0 Тогда
//						Строка.Производится = Ложь;
//						Строка.ПроизводитсяВПроцессе = Ложь;
//						МатериалыУдалить.Добавить(Строка);
//					Иначе
//						// При замене на аналоги исходная строка переводится в базовую ед. изм.
//						Строка.КоличествоУпаковок = Строка.Количество;
//						Строка.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
//					КонецЕсли;
//					
//				Иначе
//			//-- НЕ УТКА
//					
//					// Обеспечение из остатков на складе
//					СтрокаЗаполнить = Неопределено;
//					Если Строка.Количество = КоличествоЗачет Тогда
//						СтрокаЗаполнить = Строка;
//					Иначе
//						НоваяСтрока = ДанныеСпецификации.МатериалыИУслуги.Добавить();
//						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
//						НоваяСтрока.Количество = КоличествоЗачет;
//						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
//							* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
//						
//						СтрокаЗаполнить = НоваяСтрока;
//						
//						Строка.Количество = Строка.Количество - КоличествоЗачет;
//						Строка.КоличествоУпаковок = Строка.Количество
//							* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
//					КонецЕсли;
//					
//					СтрокаЗаполнить.Производится = Ложь;
//					СтрокаЗаполнить.ПроизводитсяВПроцессе = Ложь;
//					СтрокаЗаполнить.ИсточникПолученияПолуфабриката = Справочники.РесурсныеСпецификации.ПустаяСсылка();
//					//++ Устарело_Производство21
//					СтрокаЗаполнить.СпособПолученияПолуфабриката = Перечисления.СпособыПолученияМатериаловВСпецификации.ПустаяСсылка();
//					//-- Устарело_Производство21
//					СтрокаЗаполнить.Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
//					СтрокаЗаполнить.СтатьяКалькуляции = Справочники.СтатьиКалькуляции.ПустаяСсылка();
//					СтрокаЗаполнить.Обособленно = Обеспечение.Обособленно;
//					СтрокаЗаполнить.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
//					
//			//++ НЕ УТКА	
//				КонецЕсли;
//			//-- НЕ УТКА
//				
//				Обеспечение.Количество = Обеспечение.Количество - КоличествоЗачет;
//			КонецЦикла;
//			
//			// Добавление выходов
//			Для каждого Связь Из Потребность.Выходы Цикл
//				Связь.Связь = Неопределено; // Разрыв циклических ссылок
//				
//				Если ВсегоПартий = 1 Тогда
//					СтрокаРС = Связь.СтрокаРС;
//				Иначе
//					ТаблицаРС = Связь.СтрокаРС.Владелец(); // ТаблицаЗначений
//					СтрокаРС = ДанныеСпецификации[Связь.СтрокаРСИмяВладельца][ТаблицаРС.Индекс(Связь.СтрокаРС)];
//				КонецЕсли;
//				
//				Выход = Выходы.Добавить();
//				Выход.Идентификатор = Связь.СвязьИдентификатор;
//				Выход.Этап = Связь.СвязьЭтап;
//				Выход.СтрокаРС = СтрокаРС;
//				Выход.СтрокаРСИмяВладельца = Связь.СтрокаРСИмяВладельца;
//				Выход.Номенклатура = Связь.СтрокаРС.Номенклатура;
//				Выход.Характеристика = Связь.СтрокаРС.Характеристика;
//				Выход.ДанныеСпецификации = ДанныеСпецификации;
//				Выход.Потребность = Потребность;
//			КонецЦикла;
//			
//			// Добавление входов
//			Для каждого Связь Из Потребность.Входы Цикл
//				Связь.Связь = Неопределено; // Разрыв циклических ссылок
//				
//				Если ВсегоПартий = 1 Тогда
//					СтрокаРС = Связь.СтрокаРС;
//				Иначе
//					ТаблицаРС = Связь.СтрокаРС.Владелец(); // ТаблицаЗначений
//					СтрокаРС = ДанныеСпецификации[Связь.СтрокаРСИмяВладельца][ТаблицаРС.Индекс(Связь.СтрокаРС)];
//				КонецЕсли;
//				Если Связь.Родитель                  // Связи с родительскими потребностями добавляются через входящие изделия
//					ИЛИ НЕ СтрокаРС.Производится Тогда // Потребность закрыта обеспечением
//					Продолжить; 
//				КонецЕсли;
//				
//				Вход = Входы.Добавить();
//				Вход.Идентификатор = Потребность.Идентификатор;
//				Вход.Этап = СтрокаРС.Этап;
//				Вход.СтрокаРС = СтрокаРС;
//				Вход.Номенклатура = Связь.СтрокаРС.Номенклатура;
//				Вход.Характеристика = Связь.СтрокаРС.Характеристика;
//				Вход.КодЭтапа = ДанныеСпецификации.Этапы.Найти(Вход.СтрокаРС.Этап, "Этап").КодЭтапа;
//				Вход.ДанныеСпецификации = ДанныеСпецификации;
//			КонецЦикла;
//			//++ НЕ УТКА
//			Для каждого Строка Из ДанныеСпецификации.ВходящиеИзделия Цикл
//				Если Строка.Распределено = Строка.Количество Тогда
//					Продолжить;
//				КонецЕсли;
//				Вход = Входы.Добавить();
//				Вход.Идентификатор = Потребность.Идентификатор;
//				Вход.Этап = Строка.Этап;
//				Вход.СтрокаРС = Строка;
//				Вход.Номенклатура = Строка.Номенклатура;
//				Вход.Характеристика = Строка.Характеристика;
//				Вход.КодЭтапа = ДанныеСпецификации.Этапы.Найти(Строка.Этап, "Этап").КодЭтапа;
//				Вход.ДанныеСпецификации = ДанныеСпецификации;
//			КонецЦикла;
//			//-- НЕ УТКА
//			
//			// Добавление связей по ПФ, производимым на этапе
//			Для каждого Строка Из ДанныеСпецификации.МатериалыИУслуги.НайтиСтроки(СтПоискаПФНаЭтапе) Цикл
//				Вход = Входы.Добавить();
//				Вход.Идентификатор = Потребность.Идентификатор;
//				Вход.Этап = Строка.Этап;
//				Вход.СтрокаРС = Строка;
//				Вход.Номенклатура = Строка.Номенклатура;
//				Вход.Характеристика = Строка.Характеристика;
//				Вход.КодЭтапа = ДанныеСпецификации.Этапы.Найти(Строка.Этап, "Этап").КодЭтапа;
//				Вход.ДанныеСпецификации = ДанныеСпецификации;
//				
//				СтПоискаНХЭтап.Номенклатура = Строка.Номенклатура;
//				СтПоискаНХЭтап.Характеристика = Строка.Характеристика;
//				СтПоискаНХЭтап.Этап = Строка.ИсточникПолученияПолуфабриката;
//				
//				Для каждого СтрокаВыход Из ДанныеСпецификации.ВозвратныеОтходы.НайтиСтроки(СтПоискаНХЭтап) Цикл
//					Выход = Выходы.Добавить();
//					Выход.Идентификатор = Потребность.Идентификатор;
//					Выход.Этап = Строка.Этап;
//					Выход.СтрокаРС = СтрокаВыход;
//					Выход.СтрокаРСИмяВладельца = "ВозвратныеОтходы";
//					Выход.Номенклатура = СтрокаВыход.Номенклатура;
//					Выход.Характеристика = СтрокаВыход.Характеристика;
//					Выход.ДанныеСпецификации = ДанныеСпецификации;
//					Выход.Потребность = Потребность;
//				КонецЦикла;
//			КонецЦикла;
//			
//			Для каждого Строка Из МатериалыУдалить Цикл
//				ДанныеСпецификации.МатериалыИУслуги.Удалить(Строка);
//			КонецЦикла;
//			
//			//++ Гурьев 13.09.23 Перенос комментария к заказу в этапы
//			ДанныеСпецификации.Вставить("КАНАТ_КомментарийКЗаказу", Потребность.КАНАТ_КомментарийКЗаказу);
//			ДанныеСпецификации.Вставить("КАНАТ_Сертификат", Потребность.КАНАТ_Сертификат);
//			//-- Гурьев 13.09.23
//			
//			Результат.Добавить(ДанныеСпецификации);
//		КонецЦикла;
//	КонецЦикла;
//	
//	// Построение связей
//	Входы.Сортировать("Идентификатор, Этап, Номенклатура, Характеристика", Новый СравнениеЗначений());
//	Выходы.Сортировать("Идентификатор, Этап, Номенклатура, Характеристика", Новый СравнениеЗначений());
//	ИндВыход = 0;
//	ИндВыходМакс = Выходы.Количество()-1;
//	
//	Для ИндВход = 0 По Входы.Количество()-1 Цикл
//		Вход = Входы[ИндВход];
//		Остаток = Вход.СтрокаРС.Количество;
//		ИндВыход = ?(ИндВыход <= ИндВыходМакс, ИндВыход, 0);
//		Пока ИндВыход <= ИндВыходМакс Цикл
//			Выход = Выходы[ИндВыход];
//			
//			Если Выход.СтрокаРС.Распределено = Выход.СтрокаРС.Количество
//				ИЛИ Выход.СтрокаРС.Количество = 0
//				ИЛИ Выход.Идентификатор <> Вход.Идентификатор
//				ИЛИ Выход.Этап <> Вход.Этап
//				ИЛИ Выход.Номенклатура <> Вход.Номенклатура
//				ИЛИ Выход.Характеристика <> Вход.Характеристика
//					И ЗначениеЗаполнено(Выход.Характеристика) Тогда
//				ИндВыход = ИндВыход + 1;
//				Продолжить;
//			КонецЕсли;
//			
//			Если Не Выход.Потребность.ПланироватьНеРанее.Пустая() Тогда // Привязка к этапу ПланироватьНеРанее
//				Выход.ДанныеСпецификации.ПланироватьНеРанееКодЭтапа =
//					Вход.ДанныеСпецификации.Этапы.Найти(Выход.Потребность.ПланироватьНеРанее, "Этап").КодЭтапа;
//			КонецЕсли;
//			
//			Если Выход.СтрокаРС.Распределено <> 0 
//				ИЛИ Выход.СтрокаРС.Количество > Остаток Тогда
//				СтрокаВыход = Выход.СтрокаРС.Владелец().Вставить(0);
//				ЗаполнитьЗначенияСвойств(СтрокаВыход, Выход.СтрокаРС);
//				СтрокаВыход.Количество = Мин((Выход.СтрокаРС.Количество-Выход.СтрокаРС.Распределено), Остаток);
//				СтрокаВыход.КоличествоУпаковок = СтрокаВыход.Количество * СтрокаВыход.ДанныеУпаковки.Знаменатель / СтрокаВыход.ДанныеУпаковки.Числитель;
//				
//				Выход.СтрокаРС.Количество = Выход.СтрокаРС.Количество - СтрокаВыход.Количество;
//				Выход.СтрокаРС.КоличествоУпаковок = Выход.СтрокаРС.Количество * Выход.СтрокаРС.ДанныеУпаковки.Знаменатель / Выход.СтрокаРС.ДанныеУпаковки.Числитель;
//				
//				Если Выход.СтрокаРСИмяВладельца = "ВыходныеИзделия" Тогда
//					ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
//						СтрокаВыход, Выход.СтрокаРС, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
//				КонецЕсли;
//				
//				// Контроль соблюдения правил округления
//				Если Выход.СтрокаРС.Округлить
//					И Окр(Выход.СтрокаРС.Количество) <> Выход.СтрокаРС.Количество Тогда
//					
//					Если Выход.СтрокаРС.Распределено = 0 Тогда
//						Выход.СтрокаРС.Получатель = Вход.СтрокаРС.Склад;
//						Выход.СтрокаРС.Округлить = Ложь;
//					ИначеЕсли Выход.СтрокаРС.Количество > Выход.СтрокаРС.Распределено Тогда
//						НоваяСтрока = Выход.СтрокаРС.Владелец().Вставить(0);
//						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выход.СтрокаРС);
//						НоваяСтрока.Количество = Выход.СтрокаРС.Количество - Выход.СтрокаРС.Распределено;
//						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество * НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
//						НоваяСтрока.Распределено = 0;
//						НоваяСтрока.Получатель = Вход.СтрокаРС.Склад;
//						НоваяСтрока.Округлить = Ложь;
//						
//						Выход.СтрокаРС.Количество = Выход.СтрокаРС.Распределено;
//						Выход.СтрокаРС.КоличествоУпаковок = Выход.СтрокаРС.Количество * Выход.СтрокаРС.ДанныеУпаковки.Знаменатель / Выход.СтрокаРС.ДанныеУпаковки.Числитель;
//						
//						Если Выход.СтрокаРСИмяВладельца = "ВыходныеИзделия" Тогда
//							ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
//								НоваяСтрока, Выход.СтрокаРС, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
//						КонецЕсли;
//					КонецЕсли;	
//				КонецЕсли;
//			Иначе
//				СтрокаВыход = Выход.СтрокаРС;
//				ИндВыход = ИндВыход + 1;
//			КонецЕсли;
//			
//			СтрокаВыход.Получатель = ?(Вход.СтрокаРС.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа,
//				Вход.СтрокаРС.ПодразделениеЭтапа,
//				Вход.СтрокаРС.Склад);
//			СтрокаВыход.КодЭтапаПолучателя = Вход.КодЭтапа;
//			СтрокаВыход.Распределено = СтрокаВыход.Количество;
//			
//			Если Выход.СтрокаРС.ЛюбаяХарактеристика
//				И Не ЗначениеЗаполнено(Выход.Характеристика) Тогда
//				СтрокаВыход.Характеристика = Вход.СтрокаРС.Характеристика;
//			КонецЕсли;
//			
//			Остаток = Остаток - СтрокаВыход.Количество;
//			Если Остаток = 0 Тогда
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЦикла;
//	
//	Возврат Результат;
//	
//КонецФункции

&ИзменениеИКонтроль("РазделитьПотребностиНаПартии")
Функция КАНАТ_РазделитьПотребностиНаПартии(Потребности, ПараметрыРазузлования)

	Результат = Новый Массив;

	Входы = Новый ТаблицаЗначений;
	Входы.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла));
	Входы.Колонки.Добавить("Этап", Новый ОписаниеТипов("СправочникСсылка.ЭтапыПроизводства"));
	Входы.Колонки.Добавить("СтрокаРС", Новый ОписаниеТипов("СтрокаТаблицыЗначений"));
	Входы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Входы.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Входы.Колонки.Добавить("КодЭтапа", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла));
	Входы.Колонки.Добавить("ДанныеСпецификации", Новый ОписаниеТипов("Структура"));

	Выходы = Новый ТаблицаЗначений;
	Выходы.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла));
	Выходы.Колонки.Добавить("Этап", Новый ОписаниеТипов("СправочникСсылка.ЭтапыПроизводства"));
	Выходы.Колонки.Добавить("СтрокаРС", Новый ОписаниеТипов("СтрокаТаблицыЗначений"));
	Выходы.Колонки.Добавить("СтрокаРСИмяВладельца", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки));
	Выходы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Выходы.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Выходы.Колонки.Добавить("ДанныеСпецификации", Новый ОписаниеТипов("Структура"));
	Выходы.Колонки.Добавить("Потребность", Новый ОписаниеТипов("СтрокаТаблицыЗначений"));

	СтПоискаПФНаЭтапе = Новый Структура("СпособПолученияМатериала, СпецификацияРемонта",
	Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе,
	Справочники.РесурсныеСпецификации.ПустаяСсылка());
	СтПоискаНХЭтап = Новый Структура("Номенклатура, Характеристика, Этап");
	//++ НЕ УТКА
	СтПоискаАналоги = Новый Структура("СтрокаИндекс, Разрешение");
	//-- НЕ УТКА

	Потребности.Сортировать("Порядок, Начало, Окончание, Уровень, Номенклатура, Характеристика, Спецификация, Назначение, Получатель, Отправитель");

	КодЭтапа = 10000000;
	ИдентификаторВыпускаНаЭтапе = 10000000;
	Для ИндексПотребность = 0 По Потребности.Количество()-1 Цикл

		Потребность = Потребности[ИндексПотребность];
		Если Потребность.Свернута Тогда
			Продолжить;
		КонецЕсли;

		ВсегоПартий = 1;
		Если ПараметрыРазузлования.РазделятьНаОптимальныеПартии
			И Потребность.ПартияВыпуска.Расшифровка <> Неопределено Тогда
			ВсегоПартий = Потребность.ПартияВыпуска.Расшифровка.Количество();
		КонецЕсли;

		Для СчПартий = 1 По ВсегоПартий Цикл

			// Заполнение партии
			Если ВсегоПартий = 1 Тогда
				ДанныеСпецификации = Потребность.ДанныеСпецификации;
				ПартияВыпуска = Потребность.ПартияВыпуска;
			Иначе
				ДанныеСпецификации = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Потребность.ДанныеСпецификации);

				ПартияВыпуска = Потребность.ПартияВыпуска.Расшифровка[СчПартий-1];
				ДанныеПоНоменклатуре = Справочники.РесурсныеСпецификации.ДанныеПоНоменклатуреРасширенный();
				ЗаполнитьЗначенияСвойств(ДанныеПоНоменклатуре, Потребность);
				Справочники.РесурсныеСпецификации.РассчитатьКоличествоНаПартиюВыпуска(ПартияВыпуска, ДанныеСпецификации, ДанныеПоНоменклатуре);

				Для каждого Этап Из ДанныеСпецификации.Этапы Цикл
					Этап.КодЭтапа = КодЭтапа;
					КодЭтапа = КодЭтапа + 1;
				КонецЦикла;
			КонецЕсли;

			ДобавитьПоляВДанныеСпецификации(ДанныеСпецификации, ПараметрыРазузлования);

			ЗаполнитьЗначенияСвойств(
			ДанныеСпецификации,
			Потребность,
			"ДатаЗапуска, ДатаВыпуска, Начало, Окончание, РазмещениеВыпуска"
			+ ?(ПустаяСтрока(ПараметрыРазузлования.ПоляГруппировки), "", "," + ПараметрыРазузлования.ПоляГруппировки)
			+ ?(ПустаяСтрока(ПараметрыРазузлования.ДополнительнаяИнформация), "", "," + ПараметрыРазузлования.ДополнительнаяИнформация));

			ДанныеСпецификации.ПартияВыпуска = ПартияВыпуска;

			Если ДанныеСпецификации.ВыходныеИзделия.Количество() <> 0 Тогда
				ДанныеСпецификации.ВыходныеИзделия.ЗагрузитьКолонку(
				ДанныеСпецификации.ВыходныеИзделия.ВыгрузитьКолонку("Склад"), "Получатель");
			КонецЕсли;
			Если ДанныеСпецификации.ВозвратныеОтходы.Количество() <> 0 Тогда
				ДанныеСпецификации.ВозвратныеОтходы.ЗагрузитьКолонку(
				ДанныеСпецификации.ВозвратныеОтходы.ВыгрузитьКолонку("Склад"), "Получатель");
			КонецЕсли;

			// Заполнение реквизитов по входящим данным
			Для Индекс = 0 По Потребность.СвернутыеВходящиеПотребности.Количество() Цикл
				ВхПотребность = ?(Индекс = 0,
				?(Потребность.ЭтоВходящаяПотребность, Потребность, Неопределено),
				Потребность.СвернутыеВходящиеПотребности[Индекс - 1]);
				Если ВхПотребность = Неопределено ИЛИ ВхПотребность.Количество = 0 Тогда
					Продолжить;
				КонецЕсли;

				//++ НЕ УТКА
				Если ВхПотребность.ЭтоРазборка Тогда

					Для каждого Строка Из ДанныеСпецификации.ВходящиеИзделия Цикл

						Если Строка.Распределено = Строка.Количество
							ИЛИ Строка.Номенклатура <> ВхПотребность.Номенклатура
							ИЛИ Строка.Характеристика <> ВхПотребность.Характеристика
							И ЗначениеЗаполнено(Строка.Характеристика)
							И НЕ Строка.ЛюбаяХарактеристика Тогда
							Продолжить;
						КонецЕсли;

						Если ВхПотребность.Количество >= Строка.Количество Тогда
							СтрокаЗаполнить = Строка;
						Иначе
							НоваяСтрока = ДанныеСпецификации.ВходящиеИзделия.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
							НоваяСтрока.Количество = ВхПотребность.Количество;
							НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
							* НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
							СтрокаЗаполнить = НоваяСтрока;

							Строка.Количество = Строка.Количество - ВхПотребность.Количество;
							Строка.КоличествоУпаковок = Строка.Количество
							* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
						КонецЕсли;

						Если ЗначениеЗаполнено(ВхПотребность.Отправитель) Тогда
							СтрокаЗаполнить.Склад = ВхПотребность.Отправитель;
						КонецЕсли;
						СтрокаЗаполнить.Характеристика = ВхПотребность.Характеристика;
						Если ЗначениеЗаполнено(ВхПотребность.ЭтапИсточник) Тогда
							СтрокаЗаполнить.ЭтапОтправитель = ВхПотребность.ЭтапИсточник;
							СтрокаЗаполнить.Обособленно = Истина;
							СтрокаЗаполнить.Производится = Истина;
						КонецЕсли;
						СтрокаЗаполнить.Распределено = СтрокаЗаполнить.Количество;

						ВхПотребность.Количество = ВхПотребность.Количество - СтрокаЗаполнить.Количество;
						Если ВхПотребность.Количество = 0 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;

				Иначе // Сборка и ремонт

					//-- НЕ УТКА

					Для Сч = 1 По 2 Цикл
						Для каждого Строка Из ДанныеСпецификации[?(Сч = 1, "ВыходныеИзделия", "ВозвратныеОтходы")] Цикл
							Если Строка.Распределено = Строка.Количество
								ИЛИ Строка.Номенклатура <> ВхПотребность.Номенклатура
								ИЛИ Строка.Характеристика <> ВхПотребность.Характеристика
								И ЗначениеЗаполнено(Строка.Характеристика)
								И НЕ Строка.ЛюбаяХарактеристика Тогда
								Продолжить;
							КонецЕсли;

							Распределено = Мин(Строка.Количество-Строка.Распределено, ВхПотребность.Количество);

							Если (Строка.Распределено = 0
								И ВхПотребность.Количество >= Строка.Количество)
								ИЛИ (СтрокиИдентичны(Строка, ВхПотребность,
								"Характеристика,Получатель,Назначение,СписатьНаРасходы,СтатьяРасходов,АналитикаРасходов,АналитикаАктивовПассивов")
								И Строка.ЭтапПотребитель = ВхПотребность.ЭтапИсточник) Тогда

								// Разделять строку не нужно
								СтрокаЗаполнить = Строка;

							ИначеЕсли Строка.Округлить
								И НЕ Строка.ЭтоЦеховаяКладовая
								И Окр(Строка.Количество - Распределено) <> (Строка.Количество - Распределено) Тогда

								// При разделении строки будут нарушены правила округления
								Если Строка.Распределено = 0 Тогда
									Строка.Округлить = Ложь;
									СтрокаЗаполнить = Строка;
								Иначе
									ВладелецСтроки = Строка.Владелец(); // ТаблицаЗначений
									НоваяСтрока = ВладелецСтроки.Добавить();
									ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
									НоваяСтрока.Количество = Строка.Количество - Строка.Распределено;
									НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
									* НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
									НоваяСтрока.Распределено = 0;
									НоваяСтрока.Округлить = Ложь;
									СтрокаЗаполнить = НоваяСтрока;

									Строка.Количество = Строка.Распределено;
									Строка.КоличествоУпаковок = Строка.Количество
									* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
									Если Сч = 1 Тогда
										ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
										НоваяСтрока, Строка, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
									КонецЕсли;
								КонецЕсли;

							Иначе

								// Разделение строки
								ВладелецСтроки = Строка.Владелец(); // ТаблицаЗначений
								НоваяСтрока = ВладелецСтроки.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
								НоваяСтрока.Количество = Распределено;
								НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
								* НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
								НоваяСтрока.Распределено = 0;
								СтрокаЗаполнить = НоваяСтрока;

								Строка.Количество = Строка.Количество - Распределено;
								Строка.КоличествоУпаковок = Строка.Количество
								* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
								Если Сч = 1 Тогда
									ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
									НоваяСтрока, Строка, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
								КонецЕсли;

							КонецЕсли;

							ЗаполнитьЗначенияСвойств(СтрокаЗаполнить, ВхПотребность,
							"Характеристика,Получатель,Назначение,СписатьНаРасходы,СтатьяРасходов,АналитикаРасходов,АналитикаАктивовПассивов");
							СтрокаЗаполнить.ЭтапПотребитель = ВхПотребность.ЭтапИсточник;
							СтрокаЗаполнить.Распределено = СтрокаЗаполнить.Распределено + Распределено;

							ВхПотребность.Количество = ВхПотребность.Количество - Распределено;
							Если ВхПотребность.Количество = 0 Тогда
								Прервать;
							КонецЕсли;

						КонецЦикла;
						Если ВхПотребность.Количество = 0 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;

					//++ НЕ УТКА	
				КонецЕсли;
				//-- НЕ УТКА

			КонецЦикла;

			// Зачет данных обеспечения
			Свертка = Новый Соответствие;
			МатериалыУдалить = Новый Массив;
			Для каждого Обеспечение Из Потребность.Обеспечение Цикл
				Строка = ДанныеСпецификации.МатериалыИУслуги[Обеспечение.СтрокаИндекс];
				Если Обеспечение.Количество = 0 ИЛИ Строка.Количество = 0 ИЛИ НЕ Строка.Производится Тогда
					Продолжить;
				КонецЕсли;

				КоличествоЗачет = Мин(Строка.Количество, Обеспечение.Количество);

				//++ НЕ УТКА
				Если Обеспечение.ЗаменаНаАналог Тогда

					// Обеспечение через замену на аналоги
					ЗаполнитьЗначенияСвойств(СтПоискаАналоги, Обеспечение);
					Для каждого Аналог Из Потребность.Аналоги.НайтиСтроки(СтПоискаАналоги) Цикл
						НоваяСтрока = ДанныеСпецификации.МатериалыИУслуги.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Аналог, "Номенклатура,Характеристика,Склад");
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Этап,ПодразделениеЭтапа");
						Если Обеспечение.Количество = КоличествоЗачет Тогда
							НоваяСтрока.Количество = Аналог.Количество;
						Иначе
							НоваяСтрока.Количество = ОКР(Аналог.Количество * КоличествоЗачет / Обеспечение.Количество, 3);
							Аналог.Количество = Аналог.Количество - НоваяСтрока.Количество;
						КонецЕсли;
						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
						НоваяСтрока.Обособленно = Обеспечение.Обособленно;
						НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
						НоваяСтрока.Производится = Ложь;
					КонецЦикла;

					Строка.Количество = Строка.Количество - КоличествоЗачет;
					Если Строка.Количество = 0 Тогда
						Строка.Производится = Ложь;
						Строка.ПроизводитсяВПроцессе = Ложь;
						МатериалыУдалить.Добавить(Строка);
					Иначе
						// При замене на аналоги исходная строка переводится в базовую ед. изм.
						Строка.КоличествоУпаковок = Строка.Количество;
						Строка.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
					КонецЕсли;

				Иначе
					//-- НЕ УТКА

					// Обеспечение из остатков на складе
					СтрокаЗаполнить = Неопределено;
					Если Строка.Количество = КоличествоЗачет Тогда
						СтрокаЗаполнить = Строка;
					Иначе
						НоваяСтрока = ДанныеСпецификации.МатериалыИУслуги.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						НоваяСтрока.Количество = КоличествоЗачет;
						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество
						* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;

						СтрокаЗаполнить = НоваяСтрока;

						Строка.Количество = Строка.Количество - КоличествоЗачет;
						Строка.КоличествоУпаковок = Строка.Количество
						* Строка.ДанныеУпаковки.Знаменатель / Строка.ДанныеУпаковки.Числитель;
					КонецЕсли;

					СтрокаЗаполнить.Производится = Ложь;
					СтрокаЗаполнить.ПроизводитсяВПроцессе = Ложь;
					СтрокаЗаполнить.ИсточникПолученияПолуфабриката = Справочники.РесурсныеСпецификации.ПустаяСсылка();
					//++ Устарело_Производство21
					СтрокаЗаполнить.СпособПолученияПолуфабриката = Перечисления.СпособыПолученияМатериаловВСпецификации.ПустаяСсылка();
					//-- Устарело_Производство21
					СтрокаЗаполнить.Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
					СтрокаЗаполнить.Обособленно = Обеспечение.Обособленно;
					СтрокаЗаполнить.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;

					//++ НЕ УТКА	
				КонецЕсли;
				//-- НЕ УТКА

				Обеспечение.Количество = Обеспечение.Количество - КоличествоЗачет;
			КонецЦикла;

			// Добавление выходов
			Для каждого Связь Из Потребность.Выходы Цикл
				Связь.Связь = Неопределено; // Разрыв циклических ссылок

				Если ВсегоПартий = 1 Тогда
					СтрокаРС = Связь.СтрокаРС;
				Иначе
					ТаблицаРС = Связь.СтрокаРС.Владелец(); // ТаблицаЗначений
					СтрокаРС = ДанныеСпецификации[Связь.СтрокаРСИмяВладельца][ТаблицаРС.Индекс(Связь.СтрокаРС)];
				КонецЕсли;

				Выход = Выходы.Добавить();
				Выход.Идентификатор = Связь.СвязьИдентификатор;
				Выход.Этап = Связь.СвязьЭтап;
				Выход.СтрокаРС = СтрокаРС;
				Выход.СтрокаРСИмяВладельца = Связь.СтрокаРСИмяВладельца;
				Выход.Номенклатура = Связь.СтрокаРС.Номенклатура;
				Выход.Характеристика = Связь.СтрокаРС.Характеристика;
				Выход.ДанныеСпецификации = ДанныеСпецификации;
				Выход.Потребность = Потребность;
			КонецЦикла;

			// Добавление входов
			Для каждого Связь Из Потребность.Входы Цикл
				Связь.Связь = Неопределено; // Разрыв циклических ссылок

				Если ВсегоПартий = 1 Тогда
					СтрокаРС = Связь.СтрокаРС;
				Иначе
					ТаблицаРС = Связь.СтрокаРС.Владелец(); // ТаблицаЗначений
					СтрокаРС = ДанныеСпецификации[Связь.СтрокаРСИмяВладельца][ТаблицаРС.Индекс(Связь.СтрокаРС)];
				КонецЕсли;
				Если Связь.Родитель                  // Связи с родительскими потребностями добавляются через входящие изделия
					ИЛИ НЕ СтрокаРС.Производится Тогда // Потребность закрыта обеспечением
					Продолжить; 
				КонецЕсли;

				Вход = Входы.Добавить();
				Вход.Идентификатор = Потребность.Идентификатор;
				Вход.Этап = СтрокаРС.Этап;
				Вход.СтрокаРС = СтрокаРС;
				Вход.Номенклатура = Связь.СтрокаРС.Номенклатура;
				Вход.Характеристика = Связь.СтрокаРС.Характеристика;
				Вход.КодЭтапа = ДанныеСпецификации.Этапы.Найти(Вход.СтрокаРС.Этап, "Этап").КодЭтапа;
				Вход.ДанныеСпецификации = ДанныеСпецификации;
			КонецЦикла;
			//++ НЕ УТКА
			Для каждого Строка Из ДанныеСпецификации.ВходящиеИзделия Цикл
				Если Строка.Распределено = Строка.Количество Тогда
					Продолжить;
				КонецЕсли;
				Вход = Входы.Добавить();
				Вход.Идентификатор = Потребность.Идентификатор;
				Вход.Этап = Строка.Этап;
				Вход.СтрокаРС = Строка;
				Вход.Номенклатура = Строка.Номенклатура;
				Вход.Характеристика = Строка.Характеристика;
				Вход.КодЭтапа = ДанныеСпецификации.Этапы.Найти(Строка.Этап, "Этап").КодЭтапа;
				Вход.ДанныеСпецификации = ДанныеСпецификации;
			КонецЦикла;
			//-- НЕ УТКА

			// Добавление связей по ПФ, производимым на этапе
			Для каждого Строка Из ДанныеСпецификации.МатериалыИУслуги.НайтиСтроки(СтПоискаПФНаЭтапе) Цикл
				Вход = Входы.Добавить();
				Вход.Идентификатор = ИдентификаторВыпускаНаЭтапе;
				Вход.Этап = Строка.Этап;
				Вход.СтрокаРС = Строка;
				Вход.Номенклатура = Строка.Номенклатура;
				Вход.Характеристика = Строка.Характеристика;
				Вход.КодЭтапа = ДанныеСпецификации.Этапы.Найти(Строка.Этап, "Этап").КодЭтапа;
				Вход.ДанныеСпецификации = ДанныеСпецификации;

				СтПоискаНХЭтап.Номенклатура = Строка.Номенклатура;
				СтПоискаНХЭтап.Характеристика = Строка.Характеристика;
				СтПоискаНХЭтап.Этап = Строка.ИсточникПолученияПолуфабриката;

				Для каждого СтрокаВыход Из ДанныеСпецификации.ВозвратныеОтходы.НайтиСтроки(СтПоискаНХЭтап) Цикл
					Выход = Выходы.Добавить();
					Выход.Идентификатор = ИдентификаторВыпускаНаЭтапе;
					Выход.Этап = Строка.Этап;
					Выход.СтрокаРС = СтрокаВыход;
					Выход.СтрокаРСИмяВладельца = "ВозвратныеОтходы";
					Выход.Номенклатура = СтрокаВыход.Номенклатура;
					Выход.Характеристика = СтрокаВыход.Характеристика;
					Выход.ДанныеСпецификации = ДанныеСпецификации;
					Выход.Потребность = Потребность;
				КонецЦикла;

				ИдентификаторВыпускаНаЭтапе = ИдентификаторВыпускаНаЭтапе + 1;
			КонецЦикла;

			Для каждого Строка Из МатериалыУдалить Цикл
				ДанныеСпецификации.МатериалыИУслуги.Удалить(Строка);
			КонецЦикла; 
			#Вставка
			//++ Гурьев 13.09.23 Перенос комментария к заказу в этапы
			ДанныеСпецификации.Вставить("КАНАТ_КомментарийКЗаказу", Потребность.КАНАТ_КомментарийКЗаказу);
			ДанныеСпецификации.Вставить("КАНАТ_Сертификат", Потребность.КАНАТ_Сертификат);
			//-- Гурьев 13.09.23

			#КонецВставки

			Результат.Добавить(ДанныеСпецификации);
		КонецЦикла;
	КонецЦикла;

	// Построение связей
	Входы.Сортировать("Идентификатор, Этап, Номенклатура, Характеристика", Новый СравнениеЗначений());
	Выходы.Сортировать("Идентификатор, Этап, Номенклатура, Характеристика", Новый СравнениеЗначений());
	ИндВыход = 0;
	ИндВыходМакс = Выходы.Количество()-1;

	Для ИндВход = 0 По Входы.Количество()-1 Цикл
		Вход = Входы[ИндВход];
		Остаток = Вход.СтрокаРС.Количество;
		ИндВыход = ?(ИндВыход <= ИндВыходМакс, ИндВыход, 0);
		Пока ИндВыход <= ИндВыходМакс Цикл
			Выход = Выходы[ИндВыход];

			Если Выход.СтрокаРС.Распределено = Выход.СтрокаРС.Количество
				ИЛИ Выход.СтрокаРС.Количество = 0
				ИЛИ Выход.Идентификатор <> Вход.Идентификатор
				ИЛИ Выход.Этап <> Вход.Этап
				ИЛИ Выход.Номенклатура <> Вход.Номенклатура
				ИЛИ Выход.Характеристика <> Вход.Характеристика
				И ЗначениеЗаполнено(Выход.Характеристика) Тогда
				ИндВыход = ИндВыход + 1;
				Продолжить;
			КонецЕсли;

			Если Не Выход.Потребность.ПланироватьНеРанее.Пустая() Тогда // Привязка к этапу ПланироватьНеРанее
				Выход.ДанныеСпецификации.ПланироватьНеРанееКодЭтапа =
				Вход.ДанныеСпецификации.Этапы.Найти(Выход.Потребность.ПланироватьНеРанее, "Этап").КодЭтапа;
			КонецЕсли;

			Если Выход.СтрокаРС.Распределено <> 0 
				ИЛИ Выход.СтрокаРС.Количество > Остаток Тогда
				СтрокаВыход = Выход.СтрокаРС.Владелец().Вставить(0);
				ЗаполнитьЗначенияСвойств(СтрокаВыход, Выход.СтрокаРС);
				СтрокаВыход.Количество = Мин((Выход.СтрокаРС.Количество-Выход.СтрокаРС.Распределено), Остаток);
				СтрокаВыход.КоличествоУпаковок = СтрокаВыход.Количество * СтрокаВыход.ДанныеУпаковки.Знаменатель / СтрокаВыход.ДанныеУпаковки.Числитель;

				Выход.СтрокаРС.Количество = Выход.СтрокаРС.Количество - СтрокаВыход.Количество;
				Выход.СтрокаРС.КоличествоУпаковок = Выход.СтрокаРС.Количество * Выход.СтрокаРС.ДанныеУпаковки.Знаменатель / Выход.СтрокаРС.ДанныеУпаковки.Числитель;

				Если Выход.СтрокаРСИмяВладельца = "ВыходныеИзделия" Тогда
					ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
					СтрокаВыход, Выход.СтрокаРС, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
				КонецЕсли;

				// Контроль соблюдения правил округления
				Если Выход.СтрокаРС.Округлить
					И Окр(Выход.СтрокаРС.Количество) <> Выход.СтрокаРС.Количество Тогда

					Если Выход.СтрокаРС.Распределено = 0 Тогда
						Выход.СтрокаРС.Получатель = Вход.СтрокаРС.Склад;
						Выход.СтрокаРС.Округлить = Ложь;
					ИначеЕсли Выход.СтрокаРС.Количество > Выход.СтрокаРС.Распределено Тогда
						НоваяСтрока = Выход.СтрокаРС.Владелец().Вставить(0);
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выход.СтрокаРС);
						НоваяСтрока.Количество = Выход.СтрокаРС.Количество - Выход.СтрокаРС.Распределено;
						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество * НоваяСтрока.ДанныеУпаковки.Знаменатель / НоваяСтрока.ДанныеУпаковки.Числитель;
						НоваяСтрока.Распределено = 0;
						НоваяСтрока.Получатель = Вход.СтрокаРС.Склад;
						НоваяСтрока.Округлить = Ложь;

						Выход.СтрокаРС.Количество = Выход.СтрокаРС.Распределено;
						Выход.СтрокаРС.КоличествоУпаковок = Выход.СтрокаРС.Количество * Выход.СтрокаРС.ДанныеУпаковки.Знаменатель / Выход.СтрокаРС.ДанныеУпаковки.Числитель;

						Если Выход.СтрокаРСИмяВладельца = "ВыходныеИзделия" Тогда
							ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
							НоваяСтрока, Выход.СтрокаРС, ДанныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия);
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
			Иначе
				СтрокаВыход = Выход.СтрокаРС;
				ИндВыход = ИндВыход + 1;
			КонецЕсли;

			СтрокаВыход.Получатель = ?(Вход.СтрокаРС.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа,
			Вход.СтрокаРС.ПодразделениеЭтапа,
			Вход.СтрокаРС.Склад);
			СтрокаВыход.КодЭтапаПолучателя = Вход.КодЭтапа;
			СтрокаВыход.Распределено = СтрокаВыход.Количество;

			Если Выход.СтрокаРС.ЛюбаяХарактеристика
				И Не ЗначениеЗаполнено(Выход.Характеристика) Тогда
				СтрокаВыход.Характеристика = Вход.СтрокаРС.Характеристика;
			КонецЕсли;

			Остаток = Остаток - СтрокаВыход.Количество;
			Если Остаток = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат Результат;

КонецФункции
